Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2064DAB176.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo1" edc:nmmrflags="St" edc:nmmrid="1160" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi1" edc:nmmrflags="St" edc:nmmrid="1164" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo2" edc:nmmrflags="St" edc:nmmrid="1168" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi2" edc:nmmrflags="St" edc:nmmrid="1172" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo3" edc:nmmrflags="St" edc:nmmrid="1176" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi3" edc:nmmrflags="St" edc:nmmrid="1180" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="----nnnnnnnnnnnn-nnnnnnnn-nnnnnn" edc:cname="DSPControl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSPControl" edc:nmmrflags="St" edc:nmmrid="1184" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POS" edc:desc="" edc:mask="0x3f" edc:name="POS" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SCOUNT" edc:desc="" edc:mask="0x3f" edc:name="SCOUNT" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFI" edc:desc="" edc:mask="0x1" edc:name="EFI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OUTFLAG" edc:desc="" edc:mask="0xff" edc:name="OUTFLAG" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CCOND" edc:desc="" edc:mask="0xf" edc:name="CCOND" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:NMMRPlace>
    <edc:EmulatorSector edc:beginaddr="0xff300000" edc:endaddr="0xff400000" edc:regionid="emulation"/>
    <edc:DeviceIDSector edc:_mask="0x0fffffff" edc:beginaddr="0xffffffff" edc:endaddr="0xffffffff" edc:mask="0x0fffffff" edc:regionid="devid" edc:useinchecksum="0x0fffffff" edc:value="0x05F85053">
      <edc:DEVIDToRev edc:revlist="A0" edc:value="0x00000000"/>
      <edc:DEVIDToRev edc:revlist="A1" edc:value="0x10000000"/>
      <edc:DEVIDToRev edc:revlist="B0" edc:value="0x20000000"/>
    </edc:DeviceIDSector>
    <edc:CodeSector edc:beginaddr="0x1d000000" edc:endaddr="0x1d200000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:kuseg="0x60000000" edc:regionid="code"/>
    <edc:TestZone edc:beginaddr="0x1fc74000" edc:endaddr="0x1fc78000" edc:regionid="testmem"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc40000" edc:endaddr="0x1fc4ff00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot1"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc50000" edc:endaddr="0x1fc54000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot1lastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc60000" edc:endaddr="0x1fc6ff00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot2"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc70000" edc:endaddr="0x1fc74000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot2lastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc20000" edc:endaddr="0x1fc2ff00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="upperbootalias"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc30000" edc:endaddr="0x1fc34000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="upperbootaliaslastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc00000" edc:endaddr="0x1fc0ff00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootalias"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc10000" edc:endaddr="0x1fc14000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootaliaslastpage"/>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc0ffb0" edc:endaddr="0x1fc10000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootaliasconfig">
      <edc:AdjustPoint edc:_addr="0x1FC0FFB0" edc:offset="0xc"/>
      <edc:DCRDef edc:_addr="0x1FC0FFBC" edc:access="---nnnnn------------------------" edc:cname="DEVCFG4" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x1f000000" edc:name="DEVCFG4" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:DCRFieldDef edc:cname="SWDTPS" edc:desc="Sleep Mode Watchdog Timer Postscaler" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="SPS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SPS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SPS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SPS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SPS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="SPS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SPS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="SPS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SPS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="SPS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="SPS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="SPS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="SPS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="SPS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="SPS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="SPS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="SPS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="SPS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="SPS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="SPS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="SPS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
