Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2064DAB176.PIC
      <edc:SFRDef edc:_addr="0x1F8C028C" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="21" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR20" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR20" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C0290" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="22" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR21" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR21" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C0294" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="23" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR22" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR22" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C0298" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="24" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR23" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR23" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C029C" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="25" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR24" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR24" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C02A0" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="26" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR25" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR25" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C02A4" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="27" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR26" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR26" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C02A8" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="28" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR27" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR27" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C02AC" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="29" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR28" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR28" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
